Autodesk.Revit.DB.PointCloudType.Create(Autodesk.Revit.DB.Document,System.String,System.String)
Creates a new point cloud type for a given point cloud engine.
Remarks:
A list of supported engine identifiers and whether they are file-based or not can be
obtained from PointCloudEngineRegistry. The method GetSupportedEngines() returns a list
of the identifiers registered for engines.
document:
The document in which to create the point cloud.
engineIdentifier:
The string identifying the engine to be invoked.
It should be the file extension or engine identifier registered by the third party.
typeIdentifier:
The file name or the identification string for a non-file based engine.
Returns:
The newly created PointCloudType object to be used to create instances of
this point cloud.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The engine identifier was not found in the Revit session.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The external file could not be found or loaded.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to create a point cloud from the third party engine.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.PointCloudType.EngineIdentifier
The identifier of the engine responsible for handling of the point cloud.
Remarks:
The built-in engine provides "rcs" and "rcp" here.
Since:
2012

Autodesk.Revit.DB.PointCloudType.GetReCapProject
This method provides a direct entry point to get access to an object from the ReCap SDK (ReCapWrapper.RCProject) from Revit. This object represents the point cloud from the RC file path stored in PointCloudType. The ReCap assembly AdskRcManaged.dll will need to be included into code using this method.
Remarks:
The coordinate system in RCProject is defined by Point Cloud. Please refer to ReCap SDK document for RCProject::getCoordinateSystem.
If you need points converted to the modeling coordinate system in Revit, you can obtain the transformation matrix from PointCloudInstance Autodesk.Revit.DB.Instance.GetTransform.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The file or PointCloudEngine is not ReCap based.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Exception happens when ReCap loading the project.
Since: 2022